# Criando os nomes

In [0]:
import pandas as pd

In [0]:
nomes_m = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m")
nomes_f = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f")

In [3]:
print("Quantidade de nomes: " + str(len(nomes_f) + len(nomes_m)))

Quantidade de nomes: 400

In [0]:
frames = [nomes_f, nomes_m]

In [5]:
frames

[         freq        nome  rank  regiao sexo
 0    11694738       MARIA     1       0    F
 1     3079729         ANA     2       0    F
 2      721637   FRANCISCA     3       0    F
 3      588783     ANTONIA     4       0    F
 4      565621     ADRIANA     5       0    F
 5      562589     JULIANA     6       0    F
 6      551855      MARCIA     7       0    F
 7      531607    FERNANDA     8       0    F
 8      529446    PATRICIA     9       0    F
 9      509869       ALINE    10       0    F
 10     479230      SANDRA    11       0    F
 11     469851      CAMILA    12       0    F
 12     464624      AMANDA    13       0    F
 13     460770       BRUNA    14       0    F
 14     456472     JESSICA    15       0    F
 15     434056     LETICIA    16       0    F
 16     430067       JULIA    17       0    F
 17     429769     LUCIANA    18       0    F
 18     417512     VANESSA    19       0    F
 19     381778     MARIANA    20       0    F
 20     378807    GABRIELA    21       0    F
 21     376202        VERA    22       0    F
 22     366797     VITORIA    23       0    F
 23     360523     LARISSA    24       0    F
 24     358175     CLAUDIA    25       0    F
 25     354980     BEATRIZ    26       0    F
 26     354720        RITA    27       0    F
 27     354625       LUANA    28       0    F
 28     354487       SONIA    29       0    F
 29     345195      RENATA    30       0    F
 ..        ...         ...   ...     ...  ...
 170     93355   MARINALVA   171       0    F
 171     92470   TERESINHA   172       0    F
 172     92065      REBECA   173       0    F
 173     91752     GERALDA   174       0    F
 174     90779    CLEONICE   175       0    F
 175     89381   ALEXANDRA   176       0    F
 176     88631        MARA   177       0    F
 177     88574     JENIFER   178       0    F
 178     88505  ELIZANGELA   179       0    F
 179     88064     LILIANE   180       0    F
 180     88023       LIDIA   181       0    F
 181     87953     IRACEMA   182       0    F
 182     86963     LIDIANE   183       0    F
 183     86816       IRACI   184       0    F
 184     86734     MARILIA   185       0    F
 185     85939      SHEILA   186       0    F
 186     85322        INES   187       0    F
 187     85317      NAIARA   188       0    F
 188     84237     POLIANA   189       0    F
 189     83485       DALVA   190       0    F
 190     83288      LURDES   191       0    F
 191     83045      TERESA   192       0    F
 192     82927       ZILDA   193       0    F
 193     82838    LUCILENE   194       0    F
 194     82626       CLARA   195       0    F
 195     82203      ROSANE   196       0    F
 196     81878     IVONETE   197       0    F
 197     81230     LUCIANE   198       0    F
 198     81100     ISADORA   199       0    F
 199     80128       NILZA   200       0    F

 [200 rows x 5 columns],         freq       nome  rank  regiao sexo
 0    5732508       JOSE     1       0    M
 1    2971935       JOAO     2       0    M
 2    2567494    ANTONIO     3       0    M
 3    1765197  FRANCISCO     4       0    M
 4    1483121     CARLOS     5       0    M
 5    1417907      PAULO     6       0    M
 6    1213557      PEDRO     7       0    M
 7    1116818      LUCAS     8       0    M
 8    1102927       LUIZ     9       0    M
 9    1101126     MARCOS    10       0    M
 10    931530       LUIS    11       0    M
 11    922744    GABRIEL    12       0    M
 12    814709     RAFAEL    13       0    M
 13    706527     DANIEL    14       0    M
 14    690098    MARCELO    15       0    M
 15    663271      BRUNO    16       0    M
 16    628539    EDUARDO    17       0    M
 17    615924     FELIPE    18       0    M
 18    611174   RAIMUNDO    19       0    M
 19    598825    RODRIGO    20       0    M
 20    590924     MANOEL    21       0    M
 21    583962     MATEUS    22       0    M
 22    578975      ANDRE    23       0    M
 23    551776   FERNANDO    24       0    M
 24    545581      FABIO    25       0    M
 25    544258   LEONARDO    26       0    M
 26    537598    GUSTAVO    27       0    M
 27    525028  GUILHERME    28       0    M
 28    506483    LEANDRO    29       0    M
 29    492149      TIAGO    30       0    M
 ..       ...        ...   ...     ...  ...
 170    76472  ALEXANDRO   171       0    M
 171    75699   VALDEMIR   172       0    M
 172    75619  WANDERSON   173       0    M
 173    75076    JAILSON   174       0    M
 174    75029      DENIS   175       0    M
 175    74729       RIAN   176       0    M
 176    74693      CELIO   177       0    M
 177    74264  CLAUDINEI   178       0    M
 178    74095   DENILSON   179       0    M
 179    73618       IAGO   180       0    M
 180    73467       EDER   181       0    M
 181    73204       YURI   182       0    M
 182    72715    CHARLES   183       0    M
 183    72507     MARLON   184       0    M
 184    72186     ALISON   185       0    M
 185    71812    JONATAN   186       0    M
 186    71759       ERIC   187       0    M
 187    71566      ELTON   188       0    M
 188    71383   VALDECIR   189       0    M
 189    70454     WESLEI   190       0    M
 190    69835   NATANAEL   191       0    M
 191    69692      ERICK   192       0    M
 192    68920    AGNALDO   193       0    M
 193    68526      KAUAN   194       0    M
 194    67758      ODAIR   195       0    M
 195    67207     WALTER   196       0    M
 196    66669    ARLINDO   197       0    M
 197    65736    MICHAEL   198       0    M
 198    65444     ALVARO   199       0    M
 199    65435    GEOVANE   200       0    M

 [200 rows x 5 columns]]

In [0]:
nomes = pd.concat(frames)['nome'].to_frame()

In [7]:
nomes.sample(5)

        nome
104      EVA
92     DIOGO
141    NEIDE
47     LUCIA
196  IVONETE

# Incluindo ID dos alunos

In [0]:
import numpy as np
np.random.seed(123)

In [9]:
total_alunos = len(nomes)
total_alunos

400

In [0]:
nomes["id_aluno"] = np.random.permutation(total_alunos) + 1

In [11]:
nomes.sample(5)

          nome  id_aluno
188    POLIANA       369
57      DAIANE       303
3    FRANCISCO       382
182    CHARLES        33
30    ANDERSON       111

In [0]:
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)

In [13]:
nomes.sample(5)

          nome  id_aluno                 dominio
84    SEVERINO        78  @dominiodoemail.com.br
0         JOSE       331     @servicodoemail.com
179       IAGO       340  @dominiodoemail.com.br
10      SANDRA       174  @dominiodoemail.com.br
171  TERESINHA        45  @dominiodoemail.com.br

In [0]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [15]:
nomes.sample(5)

       nome  id_aluno                 dominio                         email
114  ARTHUR       320  @dominiodoemail.com.br  arthur@dominiodoemail.com.br
57   DAIANE       303     @servicodoemail.com     daiane@servicodoemail.com
85   HELENA       221  @dominiodoemail.com.br  helena@dominiodoemail.com.br
183   IRACI         8  @dominiodoemail.com.br   iraci@dominiodoemail.com.br
189   DALVA       137  @dominiodoemail.com.br   dalva@dominiodoemail.com.br

# Criando a tabela Cursos

In [16]:
!pip3 install html5lib
!pip3 install lxml

Requirement already satisfied: html5lib in /usr/local/lib/python3.6/dist-packages (1.0.1)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from html5lib) (1.11.0)
Requirement already satisfied: webencodings in /usr/local/lib/python3.6/dist-packages (from html5lib) (0.5.1)
Requirement already satisfied: lxml in /usr/local/lib/python3.6/dist-packages (4.2.5)

In [0]:
import html5lib

In [20]:
url = 'http://tabela-cursos.herokuapp.com/index.html'
cursos = pd.read_html(url)
cursos

[                          Nome do curso
 0                 Lógica de programação
 1                         Java para Web
 2                           C# para Web
 3                         Ruby on Rails
 4                      Cursos de Python
 5                         PHP com MySql
 6                         .NET para web
 7            Novas integrações com Java
 8                          TDD com Java
 9                   Código limpo com C#
 10  Preparatório para certificação Java
 11                      Hardware básico
 12                Persistência com .NET
 13                  Desenvolvendo jogos
 14                     Análise de dados
 15                   Estatística básica
 16                  Internet das coisas
 17                Programação funcional
 18                Boas práticas em Java
 19          Orientação objetos com Java]

In [21]:
type(cursos)

list

In [0]:
cursos = cursos[0]

In [24]:
type(cursos)

pandas.core.frame.DataFrame

In [28]:
cursos.head()

           Nome do curso
0  Lógica de programação
1          Java para Web
2            C# para Web
3          Ruby on Rails
4       Cursos de Python

# Alterando o index de cursos

In [0]:
cursos = cursos.rename(columns={'Nome do curso' : 'nome_do_curso'})

In [31]:
cursos.head(2)

           nome_do_curso
0  Lógica de programação
1          Java para Web

In [0]:
cursos['id'] = cursos.index + 1

In [34]:
cursos.head()

           nome_do_curso  id
0  Lógica de programação   1
1          Java para Web   2
2            C# para Web   3
3          Ruby on Rails   4
4       Cursos de Python   5

In [0]:
cursos = cursos.set_index('id')

In [38]:
cursos.head(5)

            nome_do_curso
id
1   Lógica de programação
2           Java para Web
3             C# para Web
4           Ruby on Rails
5        Cursos de Python